### Lab 1 - Data Analysis about Arrythmia
    
Denna [Notebook](https://github.com/salgo60/Pandas_DSHI/blob/main/Lab1/DSHI_Lab1_yourname_yourlastname.ipynb)

In [1]:
from datetime import datetime
start_time  = datetime.now()
print("Last run: ", start_time)

Last run:  2023-03-24 15:53:50.158165

In [2]:
student_name = "Michel Laji"
student_id = "cl3z"
student_background = "health"

The domain area is Acute myocardial infarction: incidence rate in Scotland 2004-2021, by gender.
The purpose to study the correlation between gender and Myocardial infarction

Number of Datasets: 17
Data format: excel
Headers or describing: 3 
Values separated by: Cells
Do you need to load and analyze all the files: None

Features: 2
Observations: 17

Numerical features: Yes
Number of numerical features: 2
Names of features: Men Women (Gender)
Ordinal or nominal: Nominal

Categorical Features: Yes
Numbers of Categorical Features: 1
Name of the Categorical Features: Characteristics (Year)
Ordinal or Nominal: Ordinal

Binary features: No
Number of Binary Features: None
What binary features could be added: Previous Myocardial Infarction

In [3]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [4]:
df = pd.read_csv("Klara.csv")
df.head()

,YEAR,Filename,ORG_TYPE_DESCRIPTION,ORG_CODE,NEW_CODE,ORG_TITLE,SEX_CODE,OBS,DSR,LOWER,UPPER
0,2020,09B_055DR00++,NATIONAL,E&W,K04000001,England and Wales,M,35915,47.37,46.88,47.87
1,2020,09B_055DR00++,NATIONAL,E&W,K04000001,England and Wales,F,21690,22.09,21.80,22.39
2,2020,09B_055DR00++,NATIONAL,E&W,K04000001,England and Wales,P,57605,33.62,33.35,33.90
3,2020,09B_055DR00++,NATIONAL,ENG,E92000001,England,M,33545,47.00,46.49,47.51
4,2020,09B_055DR00++,NATIONAL,ENG,E92000001,England,F,20290,21.94,21.63,22.24

In [5]:
df.shape

(1074, 11)

In [6]:
df.dtypes

YEAR                      int64
Filename                 object
ORG_TYPE_DESCRIPTION     object
ORG_CODE                 object
NEW_CODE                 object
ORG_TITLE                object
SEX_CODE                 object
OBS                       int64
DSR                     float64
LOWER                   float64
UPPER                   float64
dtype: object

In [7]:
columns_to_delete = ["ORG_TYPE_DESCRIPTION"]
df_processed = df.drop(columns_to_delete, axis=1)
df_processed

,YEAR,Filename,ORG_CODE,NEW_CODE,ORG_TITLE,SEX_CODE,OBS,DSR,LOWER,UPPER
0,2020,09B_055DR00++,E&W,K04000001,England and Wales,M,35915,47.37,46.88,47.87
1,2020,09B_055DR00++,E&W,K04000001,England and Wales,F,21690,22.09,21.80,22.39
2,2020,09B_055DR00++,E&W,K04000001,England and Wales,P,57605,33.62,33.35,33.90
3,2020,09B_055DR00++,ENG,E92000001,England,M,33545,47.00,46.49,47.51
4,2020,09B_055DR00++,ENG,E92000001,England,F,20290,21.94,21.63,22.24
...,...,...,...,...,...,...,...,...,...,...
1069,2020,09B_055DR00++,Lon1,E13000001,Inner London,F,590,18.94,17.43,20.54
1070,2020,09B_055DR00++,Lon1,E13000001,Inner London,P,1735,29.71,28.30,31.18
1071,2020,09B_055DR00++,Lon2,E13000002,Outer London,M,2355,43.90,42.12,45.74
1072,2020,09B_055DR00++,Lon2,E13000002,Outer London,F,1440,20.63,19.57,21.73
1073,2020,09B_055DR00++,Lon2,E13000002,Outer London,P,3795,31.20,30.21,32.22

In [8]:
df.rename(columns={
                          "ORG_TITLE":"Geographic_Location",
                          "SEX_CODE": "SEX",
                        "ORG_TYPE_DESCRIPTION": "Geographic_level", 
                          })

,YEAR,Filename,Geographic_level,ORG_CODE,NEW_CODE,Geographic_Location,SEX,OBS,DSR,LOWER,UPPER
0,2020,09B_055DR00++,NATIONAL,E&W,K04000001,England and Wales,M,35915,47.37,46.88,47.87
1,2020,09B_055DR00++,NATIONAL,E&W,K04000001,England and Wales,F,21690,22.09,21.80,22.39
2,2020,09B_055DR00++,NATIONAL,E&W,K04000001,England and Wales,P,57605,33.62,33.35,33.90
3,2020,09B_055DR00++,NATIONAL,ENG,E92000001,England,M,33545,47.00,46.49,47.51
4,2020,09B_055DR00++,NATIONAL,ENG,E92000001,England,F,20290,21.94,21.63,22.24
...,...,...,...,...,...,...,...,...,...,...,...
1069,2020,09B_055DR00++,LONDON AUTHORITIES (boundaries as of April 2009),Lon1,E13000001,Inner London,F,590,18.94,17.43,20.54
1070,2020,09B_055DR00++,LONDON AUTHORITIES (boundaries as of April 2009),Lon1,E13000001,Inner London,P,1735,29.71,28.30,31.18
1071,2020,09B_055DR00++,LONDON AUTHORITIES (boundaries as of April 2009),Lon2,E13000002,Outer London,M,2355,43.90,42.12,45.74
1072,2020,09B_055DR00++,LONDON AUTHORITIES (boundaries as of April 2009),Lon2,E13000002,Outer London,F,1440,20.63,19.57,21.73
1073,2020,09B_055DR00++,LONDON AUTHORITIES (boundaries as of April 2009),Lon2,E13000002,Outer London,P,3795,31.20,30.21,32.22

In [9]:
newDf = df.rename(columns={
                          "ORG_TITLE":"Geographic_Location",
                          "SEX_CODE": "SEX",
                        "ORG_TYPE_DESCRIPTION": "Geographic_level", 
                          })

In [10]:
newDf.groupby(by="ORG_CODE").size()

ORG_CODE
00AA    3
00AB    3
00AC    3
00AD    3
00AE    3
       ..
H       3
J       3
K       3
Lon1    3
Lon2    3
Length: 358, dtype: int64

In [11]:
newDf.groupby(by=["ORG_CODE","DSR"]).size()

ORG_CODE  DSR
00AB      30.92    1
          47.31    1
          67.15    1
00AC      18.47    1
          25.44    1
                  ..
Lon1      29.71    1
          42.28    1
Lon2      20.63    1
          31.20    1
          43.90    1
Length: 1070, dtype: int64

In [12]:
newDf.groupby(by=["ORG_CODE","YEAR","DSR"]).size()

ORG_CODE  YEAR  DSR
00AB      2020  30.92    1
                47.31    1
                67.15    1
00AC      2020  18.47    1
                25.44    1
                        ..
Lon1      2020  29.71    1
                42.28    1
Lon2      2020  20.63    1
                31.20    1
                43.90    1
Length: 1070, dtype: int64

In [13]:
df.groupby(by=["YEAR","ORG_CODE","DSR"]).size()

YEAR  ORG_CODE  DSR
2020  00AB      30.92    1
                47.31    1
                67.15    1
      00AC      18.47    1
                25.44    1
                        ..
      Lon1      29.71    1
                42.28    1
      Lon2      20.63    1
                31.20    1
                43.90    1
Length: 1070, dtype: int64

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1074 entries, 0 to 1073
Data columns (total 11 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   YEAR                  1074 non-null   int64
 1   Filename              1074 non-null   object
 2   ORG_TYPE_DESCRIPTION  1074 non-null   object
 3   ORG_CODE              1074 non-null   object
 4   NEW_CODE              1074 non-null   object
 5   ORG_TITLE             1074 non-null   object
 6   SEX_CODE              1074 non-null   object
 7   OBS                   1074 non-null   int64
 8   DSR                   1070 non-null   float64
 9   LOWER                 1070 non-null   float64
 10  UPPER                 1070 non-null   float64
dtypes: float64(3), int64(2), object(6)
memory usage: 92.4+ KB

In [15]:
newDf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1074 entries, 0 to 1073
Data columns (total 11 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   YEAR                 1074 non-null   int64
 1   Filename             1074 non-null   object
 2   Geographic_level     1074 non-null   object
 3   ORG_CODE             1074 non-null   object
 4   NEW_CODE             1074 non-null   object
 5   Geographic_Location  1074 non-null   object
 6   SEX                  1074 non-null   object
 7   OBS                  1074 non-null   int64
 8   DSR                  1070 non-null   float64
 9   LOWER                1070 non-null   float64
 10  UPPER                1070 non-null   float64
dtypes: float64(3), int64(2), object(6)
memory usage: 92.4+ KB

In [16]:
newDf.describe()

         YEAR           OBS          DSR        LOWER        UPPER
count  1074.0   1074.000000  1070.000000  1070.000000  1070.000000
mean   2020.0    492.462756    33.527047    27.531000    40.628692
std       0.0   3047.305941    14.041841    12.640997    16.002617
min    2020.0      5.000000     7.010000     3.610000    12.270000
25%    2020.0     55.000000    23.005000    18.110000    28.320000
50%    2020.0    100.000000    31.195000    25.895000    37.530000
75%    2020.0    180.000000    42.212500    35.232500    50.385000
max    2020.0  57605.000000    94.960000    77.430000   115.100000

In [17]:
#df[ ["ORG_TYPE_DESCRIPTION","SEX"] ].describe()   
newDf[["Geographic_level","SEX"]]

                                      Geographic_level SEX
0                                             NATIONAL   M
1                                             NATIONAL   F
2                                             NATIONAL   P
3                                             NATIONAL   M
4                                             NATIONAL   F
...                                                ...  ..
1069  LONDON AUTHORITIES (boundaries as of April 2009)   F
1070  LONDON AUTHORITIES (boundaries as of April 2009)   P
1071  LONDON AUTHORITIES (boundaries as of April 2009)   M
1072  LONDON AUTHORITIES (boundaries as of April 2009)   F
1073  LONDON AUTHORITIES (boundaries as of April 2009)   P

[1074 rows x 2 columns]

In [18]:
newDf.isnull().sum()

YEAR                   0
Filename               0
Geographic_level       0
ORG_CODE               0
NEW_CODE               0
Geographic_Location    0
SEX                    0
OBS                    0
DSR                    4
LOWER                  4
UPPER                  4
dtype: int64

In [19]:
newDfNull = df.dropna(inplace=True)

In [20]:
newDfNull

Question number 1: Average Lower
Question number 2: Geographic Location with highest amount of female MI
Question number 3:Geographic location with most MI 2020

In [21]:
df.groupby(by="ORG_CODE").sum()

          YEAR    OBS     DSR   LOWER   UPPER
ORG_CODE
00AB      6060    330  145.38  118.05  177.15
00AC      6060    490   77.58   65.66   91.08
00AD      6060    360   80.84   66.38   97.56
00AE      6060    460  103.58   87.12  122.29
00AF      6060    465   76.33   64.34   89.94
...        ...    ...     ...     ...     ...
H         6060  11060   94.23   91.09   97.47
J         6060  15740   84.79   82.44   87.20
K         6060  10820   85.99   83.12   88.95
Lon1      6060   3465   90.93   85.50   96.62
Lon2      6060   7590   95.73   91.90   99.69

[357 rows x 5 columns]

In [22]:
df.groupby(by="YEAR").size()

YEAR
2020    1070
dtype: int64

In [23]:
df.groupby(by=["ORG_CODE", "YEAR"]).size()

ORG_CODE  YEAR
00AB      2020    3
00AC      2020    3
00AD      2020    3
00AE      2020    3
00AF      2020    3
                 ..
H         2020    3
J         2020    3
K         2020    3
Lon1      2020    3
Lon2      2020    3
Length: 357, dtype: int64

In [24]:
df.groupby(by=["ORG_CODE", "YEAR",])["LOWER"].mean()

ORG_CODE  YEAR
00AB      2020    39.350000
00AC      2020    21.886667
00AD      2020    22.126667
00AE      2020    29.040000
00AF      2020    21.446667
                    ...
H         2020    30.363333
J         2020    27.480000
K         2020    27.706667
Lon1      2020    28.500000
Lon2      2020    30.633333
Name: LOWER, Length: 357, dtype: float64

In [25]:
#df.group_keys(by=["ORG_CODE"])["Lon1"]==True

In [26]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1070 entries, 0 to 1073
Data columns (total 11 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   YEAR                  1070 non-null   int64
 1   Filename              1070 non-null   object
 2   ORG_TYPE_DESCRIPTION  1070 non-null   object
 3   ORG_CODE              1070 non-null   object
 4   NEW_CODE              1070 non-null   object
 5   ORG_TITLE             1070 non-null   object
 6   SEX_CODE              1070 non-null   object
 7   OBS                   1070 non-null   int64
 8   DSR                   1070 non-null   float64
 9   LOWER                 1070 non-null   float64
 10  UPPER                 1070 non-null   float64
dtypes: float64(3), int64(2), object(6)
memory usage: 100.3+ KB

In [27]:
df["ORG_CODE"] == "Lon1"

0       False
1       False
2       False
3       False
4       False
        ...
1069     True
1070     True
1071    False
1072    False
1073    False
Name: ORG_CODE, Length: 1070, dtype: bool

In [28]:
print(f'Average of for Inner London: { df[df["ORG_CODE"] == "Lon1"].mean() }')

Average of for Inner London: YEAR     2020.000000
OBS      1155.000000
DSR        30.310000
LOWER      28.500000
UPPER      32.206667
dtype: float64

<ipython-input-28-90b6947e2057>:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  print(f'Average of for Inner London: { df[df["ORG_CODE"] == "Lon1"].mean() }')

In [29]:
print(f'Average of for Inner London: { df[df["ORG_CODE"] == "Lon1"].mean()["DSR"] }')

Average of for Inner London: 30.310000000000002

<ipython-input-29-457f432dc2a5>:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  print(f'Average of for Inner London: { df[df["ORG_CODE"] == "Lon1"].mean()["DSR"] }')

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1070 entries, 0 to 1073
Data columns (total 11 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   YEAR                  1070 non-null   int64
 1   Filename              1070 non-null   object
 2   ORG_TYPE_DESCRIPTION  1070 non-null   object
 3   ORG_CODE              1070 non-null   object
 4   NEW_CODE              1070 non-null   object
 5   ORG_TITLE             1070 non-null   object
 6   SEX_CODE              1070 non-null   object
 7   OBS                   1070 non-null   int64
 8   DSR                   1070 non-null   float64
 9   LOWER                 1070 non-null   float64
 10  UPPER                 1070 non-null   float64
dtypes: float64(3), int64(2), object(6)
memory usage: 100.3+ KB

### Future warning

Indikerar att jag skickar in kolumner som iunte är tal --> bara skicka in kolumn ["DSR"]

In [31]:
print(f'Average of for Inner London: { df[df["ORG_CODE"] == "Lon1"]["DSR"].mean()}')

Average of for Inner London: 30.310000000000002

In [32]:
end = datetime.now()
print("Ended: ", end) 
print('Time elapsed (hh:mm:ass.ms) {}'.format(datetime.now() - start_time))

Ended:  2023-03-24 15:53:54.538318
Time elapsed (hh:mm:ass.ms) 0:00:04.391547